from .domain import Component

FURNITURE_CATALOG = {
    'REZE': {
        9: {
            '207108': Component('207108Re', 'Петля верхняя на створку 9мм ось', 70.35),
            '209503': Component('209503Re', 'Вертикальная поворотно-откидная планка 9мм ось', 68.43),
            '211503': Component('211503Re', 'Ответная планка 9мм ось', 26.02),
            '214501': Component('214501Re', 'Ответная планка блокиратора микролифта 9мм ось', 45.30),
            '221502': Component('221502Re', 'Петля на створке средняя регулируемая 9 ось', 457.60)

        },
        13: {
            '207120': Component('207120Re', 'Петля верхняя на створку 14мм ось', 70.35),
            '209101': Component('209101Re', 'Вертикальная поворотно-откидная планка 14мм ось', 68.43),
            '211101': Component('211101Re', 'Ответная планка 13мм ось', 26.02),
            '214101': Component('214101Re', 'Ответная планка блокиратора микролифта 13мм ось', 45.30),
            '221102': Component('221102Re', 'Петля на створке средняя регулируемая 13 ось', 469.21)
        },
        'default': {
            '200102': Component('200102Re', 'Привод поворотный 280-400 мм', 261.17),
            '200103': Component('200103Re', 'Привод поворотный 401-600 мм', 290.08),
            '200104': Component('200104Re', 'Привод поворотный 601-800 мм', 345.02),
            '200105': Component('200105Re', 'Привод поворотный 801-1000 мм', 395.13),
            '200106': Component('200106Re', 'Привод поворотный 1001-1200 мм', 467.41),
            '200107': Component('200107Re', 'Привод поворотный 1201-1400 мм', 512.71),
            '200108': Component('200108Re', 'Привод поворотный 1401-1600 мм', 573.42),
            '200109': Component('200109Re', 'Привод поворотный 1601-1800 мм', 624.50),
            '200110': Component('200110Re', 'Привод поворотный 1801-2000 мм', 707.38),
            '200111': Component('200111Re', 'Привод поворотный 2001-2200 мм', 754.60),
            '201121': Component('201121Re', 'Привод поворотно-откидной 500-660 мм', 227.44),
            '201122': Component('201122Re', 'Привод поворотно-откидной 661-1160 мм', 375.86),
            '201123': Component('201123Re', 'Привод поворотно-откидной 900-1400 мм', 383.57),
            '201124': Component('201124Re', 'Привод поворотно-откидной 1161-1660 мм', 567.64),
            '201125': Component('201125Re', 'Привод поворотно-откидной 1661-2160 мм', 809.54),
            '201126': Component('201126Re', 'Привод поворотно-откидной 1900-2400 мм', 836.52),
            '203101': Component('203101Re', 'Угловая передача', 227.44),
            '203103': Component('203103Re', 'Стыковочные накладки', 17.35),
            '203104': Component('203104Re', 'Угловая передача короткая', 231.30),
            '203106': Component('203106Re', 'Угловая передача микровентиляции', 299.72),
            '203108': Component('203108Re', 'Угловая передача с накладками', 261.17),
            '203110': Component('203110Re', 'Угловая передача короткая с накладками', 261.17),
            '203111': Component('203111Re', 'Угловая передача микровентиляции с накладками', 343.09),
            '204100': Component('204100Re', 'Ножницы 340-410', 447.17),
            '204101': Component('204101Re', 'Ножницы 441-650', 375.86),
            '204102': Component('204102Re', 'Ножницы 651-900', 649.56),
            '204103': Component('204103Re', 'Ножницы 901-1150', 872.18),
            '204104': Component('204104Re', 'Ножницы 1151-1400', 884.71),
            '204111': Component('204111Re', 'Ножницы 501-750', 546.44),
            '204161': Component('204161Re', 'Фрамужные ножницы', 186.96),
            '204171': Component('204171Re', 'Верхний поворотный кронштейн', 332.67),
            '205106': Component('205106Re', 'Дополнительный прижим -800', 223.48),
            '205111': Component('205111Re', 'Дополнительный прижим 900-1300', 247.67),
            '205112': Component('205112Re', 'Дополнительный прижим 801-1160', 247.67),
            '205113': Component('205113Re', 'Дополнительный прижим 900-1400', 394.72),
            '205114': Component('205114Re', 'Дополнительный прижим 1161-1660', 488.56),
            '205115': Component('205115Re', 'Дополнительный прижим 1661-1260', 624.97),
            '206101': Component('206101Re', 'Нижний прижим', 153.82),
            '206102': Component('206102Re', 'Верхний прижим', 207.08),
            '206104': Component('206104Re', 'Нижний прижим с накладками', 171.24),
            '206105': Component('206105Re', 'Верхний прижим с накладками', 144.55),
            '207207': Component('207207Re', 'Петля на створку нижняя регулируемая', 140.78),
            '208101': Component('208101Re', 'Петля верхняя рама', 99.72),
            '208201': Component('208201Re', 'Петля нижняя рама', 126.11),
            '220101': Component('220101Re', 'Комплект декоративных накладок 5шт', 36.76),
            '220107': Component('220107Re', 'Комплект декоративных накладок 2шт', 24.58),
            '220110': Component('220110Re', 'Комплект декор. накладок на средний прижим', 23.22),
            '221101': Component('221101Re', 'Блокиратор-микролифт', 93.84),
            '221103': Component('221103Re', 'Петля на створку фрамужная', 68.69),
            '221104': Component('221104Re', 'Средний прижим без накладок', 89.00)
        }
    }
}