RULES = [
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 0, 'max': 700},
            'height': {'min': 280, 'max': 400},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 2,
                },
                13: {
                    '211101': 2,
                },
                'default': {
                    '200102': 1,
                    '204171': 1
                }
            }
        }
    },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 401, 'max': 600},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 2,
                    },
                    13: {
                        '211101': 2,
                    },
                    'default': {
                        '200103': 1,
                        '204171': 1
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 601, 'max': 800},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 2,
                    },
                    13: {
                        '211101': 2,
                    },
                    'default': {
                        '200104': 1,
                        '204171': 1,
                        '221104': 1,
                        '220110': 1
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 801, 'max': 1000},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                    },
                    13: {
                        '211101': 3,
                    },
                    'default': {
                        '200105': 1,
                        '204171': 1,
                        '221104': 1,
                        '220110': 1
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 1001, 'max': 1200},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                    },
                    13: {
                        '211101': 3,
                    },
                    'default': {
                        '200106': 1,
                        '204171': 1,
                        '221104': 1,
                        '220110': 1
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 1201, 'max': 1400},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                    },
                    13: {
                        '211101': 3,
                    },
                    'default': {
                        '200107': 1,
                        '204171': 1,
                        '221104': 2,
                        '220110': 2
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 1401, 'max': 1600},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                    },
                    13: {
                        '211101': 3,
                    },
                    'default': {
                        '200108': 1,
                        '204171': 1,
                        '221104': 2,
                        '220110': 2
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 1601, 'max': 1800},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                    },
                    13: {
                        '211101': 3,
                    },
                    'default': {
                        '200109': 1,
                        '204171': 1,
                        '221104': 2,
                        '220110': 2
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 1801, 'max': 2000},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 4,
                    },
                    13: {
                        '211101': 4,
                    },
                    'default': {
                        '200110': 1,
                        '204171': 1,
                        '221104': 2,
                        '220110': 2
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 2001, 'max': 2200},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 4,
                    },
                    13: {
                        '211101': 4,
                    },
                    'default': {
                        '200111': 1,
                        '204171': 1,
                        '221104': 3,
                        '220110': 3
                    }
                }
            }
        },
    {
            'window_type': 'поворотное',
            'conditions': {
                'width': {'min': 0, 'max': 700},
                'height': {'min': 2201, 'max': 2400},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 3,
                        '209503': 1
                    },
                    13: {
                        '211101': 3,
                        '209101': 1
                    },
                    'default': {
                        '201126': 1,
                        '204171': 1,
                        '206102': 1,
                        '206104': 1,
                        '221104': 3,
                        '220110': 3
                    }
                }
            }
        },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 701, 'max': 1000},
            'height': {'min': 500, 'max': 800},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 4,
                    '209503': 1
                },
                13: {
                    '211101': 4,
                    '209101': 1
                },
                'default': {
                    '201121': 1,
                    '206104': 1,
                    '206102': 1,
                    '205112': 2,
                }
            }
        }
    },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 701, 'max': 1000},
                'height': {'min': 801, 'max': 1200},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 5,
                        '209503': 1
                    },
                    13: {
                        '211101': 5,
                        '209101': 1
                    },
                    'default': {
                        '201122': 1,
                        '206104': 1,
                        '206102': 1,
                        '205112': 2,
                        '221104': 1,
                        '220110': 1,
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 701, 'max': 1000},
                'height': {'min': 1200, 'max': 1401},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 5,
                        '209503': 1
                    },
                    13: {
                        '211101': 5,
                        '209101': 1
                    },
                    'default': {
                        '201123': 1,
                        '206104': 1,
                        '206102': 1,
                        '205112': 2,
                        '221104': 1,
                        '220110': 1,
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 701, 'max': 1000},
                'height': {'min': 1401, 'max': 1600},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 6,
                        '209503': 1
                    },
                    13: {
                        '211101': 6,
                        '209101': 1
                    },
                    'default': {
                        '201124': 1,
                        '206104': 1,
                        '206102': 1,
                        '205112': 2,
                        '221104': 2,
                        '220110': 2,
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 701, 'max': 1000},
                'height': {'min': 1601, 'max': 2000},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 6,
                        '209503': 1
                    },
                    13: {
                        '211101': 6,
                        '209101': 1
                    },
                    'default': {
                        '201125': 1,
                        '206104': 1,
                        '206102': 1,
                        '205112': 2,
                        '221104': 2,
                        '220110': 2,
                    }
                }
            }
        },
    {
            'window_type': {'поворотное'},
            'conditions': {
                'width': {'min': 701, 'max': 1000},
                'height': {'min': 2001, 'max': 2400},
            },
            'components': {
                'REZE': {
                    9: {
                        '211503': 7,
                        '209503': 1
                    },
                    13: {
                        '211101': 7,
                        '209101': 1
                    },
                    'default': {
                        '201126': 1,
                        '206104': 1,
                        '206102': 1,
                        '205112': 2,
                        '221104': 3,
                        '220110': 3,
                    }
                }
            }
        },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 500, 'max': 800},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 4,
                    '209503': 1
                },
                13: {
                    '211101': 4,
                    '209101': 1
                },
                'default': {
                    '201121': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                }
            }
        }
    },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 801, 'max': 1200},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 5,
                    '209503': 1
                },
                13: {
                    '211101': 5,
                    '209101': 1
                },
                'default': {
                    '201122': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                    '221104': 1,
                    '220110': 1,
                }
            }
        }
    },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 1200, 'max': 1401},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 5,
                    '209503': 1
                },
                13: {
                    '211101': 5,
                    '209101': 1
                },
                'default': {
                    '201123': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                    '221104': 1,
                    '220110': 1,
                }
            }
        }
    },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 1401, 'max': 1600},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 6,
                    '209503': 1
                },
                13: {
                    '211101': 6,
                    '209101': 1
                },
                'default': {
                    '201124': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                    '221104': 2,
                    '220110': 2,
                }
            }
        }
    },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 1601, 'max': 2000},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 6,
                    '209503': 1
                },
                13: {
                    '211101': 6,
                    '209101': 1
                },
                'default': {
                    '201125': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                    '221104': 2,
                    '220110': 2,
                }
            }
        }
    },
    {
        'window_type': {'поворотное'},
        'conditions': {
            'width': {'min': 1001, 'max': 1300},
            'height': {'min': 2001, 'max': 2400},
        },
        'components': {
            'REZE': {
                9: {
                    '211503': 7,
                    '209503': 1
                },
                13: {
                    '211101': 7,
                    '209101': 1
                },
                'default': {
                    '201126': 1,
                    '206104': 1,
                    '206102': 1,
                    '205113': 2,
                    '221104': 3,
                    '220110': 3,
                }
            }
        }
    },
    {
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 340, 'max': 410},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 1,
                    '211503': 1
                },
                13: {
                    '209101': 1,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204100': 1,
                }
            }
        }
    },
    {
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 340, 'max': 410},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 3,
                    '211503': 1
                },
                13: {
                    '209101': 3,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204100': 1,
                    '205106': 1
                }
            }
        }
    },
    {
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 340, 'max': 410},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204100': 1,
                    '205112': 1
                }
            }
        }
    },
    {
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 340, 'max': 410},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 6,
                        '211503': 1
                    },
                    13: {
                        '209101': 6,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204100': 1,
                        '205114': 1
                    }
                }
            }
        },
    {
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 340, 'max': 410},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204100': 1,
                        '205115': 1
                    }
                }
            }
        },
    {
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 340, 'max': 410},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204100': 1,
                        '205115': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 411, 'max': 500},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 1,
                    '211503': 1
                },
                13: {
                    '209101': 1,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204101': 1,
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 411, 'max': 500},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 3,
                    '211503': 1
                },
                13: {
                    '209101': 3,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204101': 1,
                    '205106': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 411, 'max': 500},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204101': 1,
                    '205112': 1
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 411, 'max': 500},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 6,
                        '211503': 1
                    },
                    13: {
                        '209101': 6,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204101': 1,
                        '205114': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 411, 'max': 500},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204101': 1,
                        '205115': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 411, 'max': 500},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204101': 1,
                        '205115': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 501, 'max': 650},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 1,
                    '211503': 1
                },
                13: {
                    '209101': 1,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204111': 1,
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 501, 'max': 650},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 3,
                    '211503': 1
                },
                13: {
                    '209101': 3,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204111': 1,
                    '205106': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 501, 'max': 650},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204111': 1,
                    '205112': 1
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 501, 'max': 650},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 6,
                        '211503': 1
                    },
                    13: {
                        '209101': 6,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204111': 1,
                        '205114': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 501, 'max': 650},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204111': 1,
                        '205115': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 501, 'max': 650},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204111': 1,
                        '205115': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 651, 'max': 700},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 2,
                    '211503': 1
                },
                13: {
                    '209101': 2,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 651, 'max': 700},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205106': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 651, 'max': 700},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 5,
                    '211503': 1
                },
                13: {
                    '209101': 5,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205112': 1
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 651, 'max': 700},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 7,
                        '211503': 1
                    },
                    13: {
                        '209101': 7,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205114': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 651, 'max': 700},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 9,
                        '211503': 1
                    },
                    13: {
                        '209101': 9,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 651, 'max': 700},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 9,
                        '211503': 1
                    },
                    13: {
                        '209101': 9,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 701, 'max': 800},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 3,
                    '211503': 1
                },
                13: {
                    '209101': 3,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205106': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 701, 'max': 800},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 5,
                    '211503': 1
                },
                13: {
                    '209101': 5,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205106': 2,
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 701, 'max': 800},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 6,
                    '211503': 1
                },
                13: {
                    '209101': 6,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205112': 1,
                    '205106': 1
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 701, 'max': 800},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 8,
                        '211503': 1
                    },
                    13: {
                        '209101': 8,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205114': 1,
                        '205106': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 701, 'max': 800},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 10,
                        '211503': 1
                    },
                    13: {
                        '209101': 10,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1,
                        '205106': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 701, 'max': 800},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 10,
                        '211503': 1
                    },
                    13: {
                        '209101': 10,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1,
                        '205106': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 801, 'max': 900},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205112': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 801, 'max': 900},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 6,
                    '211503': 1
                },
                13: {
                    '209101': 6,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205106': 1,
                    '205112': 1,
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 801, 'max': 900},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 7,
                    '211503': 1
                },
                13: {
                    '209101': 7,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204102': 1,
                    '205112': 2,
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 801, 'max': 900},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 9,
                        '211503': 1
                    },
                    13: {
                        '209101': 9,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205114': 1,
                        '205112': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 801, 'max': 900},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 11,
                        '211503': 1
                    },
                    13: {
                        '209101': 11,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1,
                        '205112': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 801, 'max': 900},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 11,
                        '211503': 1
                    },
                    13: {
                        '209101': 11,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204102': 1,
                        '205115': 1,
                        '205112': 1
                    }
                }
            }
        },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 500, 'max': 660},
            'width': {'min': 901, 'max': 1150},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 4,
                    '211503': 1
                },
                13: {
                    '209101': 4,
                    '211101': 1
                },
                'default': {
                    '201121': 1,
                    '203108': 1,
                    '206104': 1,
                    '204103': 1,
                    '205111': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 661, 'max': 900},
            'width': {'min': 901, 'max': 1150},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 6,
                    '211503': 1
                },
                13: {
                    '209101': 6,
                    '211101': 1
                },
                'default': {
                    '201122': 1,
                    '203108': 1,
                    '206104': 1,
                    '204103': 1,
                    '205106': 1,
                    '205111': 1
                }
            }
        }
    },
{
        'window_type': {'поворотно-откидное'},
        'conditions': {
            'height': {'min': 901, 'max': 1160},
            'width': {'min': 901, 'max': 1150},
        },
        'components': {
            'REZE': {
                9: {
                    '209503': 7,
                    '211503': 1
                },
                13: {
                    '209101': 7,
                    '211101': 1
                },
                'default': {
                    '201123': 1,
                    '203108': 1,
                    '206104': 1,
                    '204103': 1,
                    '205112': 1,
                    '205111': 1
                }
            }
        }
    },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1161, 'max': 1660},
                'width': {'min': 901, 'max': 1150},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 9,
                        '211503': 1
                    },
                    13: {
                        '209101': 9,
                        '211101': 1
                    },
                    'default': {
                        '201124': 1,
                        '203108': 1,
                        '206104': 1,
                        '204103': 1,
                        '205114': 1,
                        '205111': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1661, 'max': 1900},
                'width': {'min': 901, 'max': 1150},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 11,
                        '211503': 1
                    },
                    13: {
                        '209101': 11,
                        '211101': 1
                    },
                    'default': {
                        '201125': 1,
                        '203108': 1,
                        '206104': 1,
                        '204103': 1,
                        '205115': 1,
                        '205111': 1
                    }
                }
            }
        },
{
            'window_type': {'поворотно-откидное'},
            'conditions': {
                'height': {'min': 1901, 'max': 2400},
                'width': {'min': 901, 'max': 1150},
            },
            'components': {
                'REZE': {
                    9: {
                        '209503': 11,
                        '211503': 1
                    },
                    13: {
                        '209101': 11,
                        '211101': 1
                    },
                    'default': {
                        '201126': 1,
                        '203108': 1,
                        '206104': 1,
                        '204103': 1,
                        '205115': 1,
                        '205111': 1
                    }
                }
            }
        },

    {
        'window_type': {'поворотное', 'поворотно-откидное'},
        'conditions': {},
        'components': {
            'REZE': {
                9: {'207108': 1},
                13: {'207119': 1},
                'default': {'207207': 1, '208101': 1, '208201': 1, '220101': 1},
            }
        }
    }
]